package com.ai.project.hnwf_project.data;

/**
 * Created by sky87 on 2016-11-27.
 */

public class SaJoData {
    //년 기준년 2016년 부터 향후 100년까지
    //  입력 성초성 12개 , 성중성14개, 성종성5개, 년//향후 100년 ,월//12개,일//31개,시//24개
    public static double man_Input_1[] = {2.0 / 11.0, 9.0 / 13.0, 0.0 / 5.0, 0.0 / 100.0, 11.0 / 12.0, 27.0 / 31.0, 3.0 / 24.0}; // 윤 2016 11 27 3 남
    public static double man_Input_2[] = {6.0 / 11.0, 1.0 / 13.0, 4.0 / 5.0, 0.0 / 100.0, 1.0 / 12.0, 1.0 / 31.0, 2.0 / 24.0}; // 김 2016 1 1 2 남
    public static double man_Input_3[] = {0.0 / 11.0, 3.0 / 13.0, 2.0 / 5.0, 1.0 / 100.0, 4.0 / 12.0, 3.0 / 31.0, 12.0 / 24.0}; // 정 2017 4 3 12 남
    public static double man_Input_4[] = {9.0 / 11.0, 10.0 / 13.0, 3.0 / 5.0, 0.0 / 100.0, 7.0 / 12.0, 27.0 / 31.0, 12.0 / 24.0}; // 박 2016 7 27 12 남

    public static double man_target_one[][] = {
            {3.0 / 11.0, 1.0 / 13.0, 1.0 / 5.0}, // 시

            {4.0 / 11.0, 0.0 / 13.0, 0.0 / 5.0}, //문

            {3.0 / 11.0, 10.0 / 13.0, 2.0 / 5.0}, //상

            {3.0 / 11.0, 10.0 / 13.0, 2.0 / 5.0} //상

    };
    public static double man_target_two[][] = {
            {2.0 / 11.0, 0.0 / 13.0, 1.0 / 5.0}, // 우

            {3.0 / 11.0, 10.0 / 13.0, 2.0 / 5.0}, //상

            {2.0 / 11.0, 0.0 / 13.0, 1.0 / 5.0}, //우

            {1.0 / 11.0, 4.0 / 13.0, 1.0 / 5.0} //호

    };
}
